Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиВыводаДополнительныхПолей</name>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНаУстройстве</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/InformationRegisters/SUI_НастройкиДокументовМобильныхУстройств/SUI_НастройкиДокументовМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_НастройкиДокументовМобильныхУстройств</name>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_СостоянияДокументовОбмена/SUI_СостоянияДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СостоянияДокументовОбмена</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>КВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Загружен</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_ТипыИдентификацииСтрокТЧ/SUI_ТипыИдентификацииСтрокТЧ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыИдентификацииСтрокТЧ</name>
  <enumValues>
    <name>ПоРеквизиту</name>
  </enumValues>
  <enumValues>
    <name>ПоСовокупностиРеквизитов</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("НастройкиСхемыКомпоновкиДанных") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.НастройкиСхемыКомпоновкиДанных) = Тип("НастройкиКомпоновкиДанных") Тогда
			НастройкиСхемыКомпоновкиДанных = Новый ХранилищеЗначения(ДанныеЗаполнения.НастройкиСхемыКомпоновкиДанных, Новый СжатиеДанных(9));
		Иначе
			НастройкиСхемыКомпоновкиДанных = Новый ХранилищеЗначения(Неопределено, Новый СжатиеДанных(9));
		КонецЕсли; 

	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ДополнительныеНастройки") Тогда
		 
		Если ТипЗнч(ДанныеЗаполнения.ДополнительныеНастройки) = Тип("Структура") И
			ДанныеЗаполнения.ДополнительныеНастройки.Свойство("АлгоритмыОбработкиСтрокТабличныхЧастей") И
			ТипЗнч(ДанныеЗаполнения.ДополнительныеНастройки.АлгоритмыОбработкиСтрокТабличныхЧастей) = Тип("Соответствие") Тогда
			ДополнительныеНастройки = Новый ХранилищеЗначения(ДанныеЗаполнения.ДополнительныеНастройки, Новый СжатиеДанных(9));
		Иначе
			ДополнительныеНастройки = Новый ХранилищеЗначения(Неопределено, Новый СжатиеДанных(9));
		КонецЕсли;
	
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("СоответствияРеквизитов") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.СоответствияРеквизитов) = Тип("ТаблицаЗначений") И
			ДанныеЗаполнения.СоответствияРеквизитов.Количество() > 0 Тогда
			СоответствияРеквизитов.Загрузить(ДанныеЗаполнения.СоответствияРеквизитов);
		Иначе
			СоответствияРеквизитов.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("НастройкиЗаполненияРеквизитовПередЗаписью") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.НастройкиЗаполненияРеквизитовПередЗаписью) = Тип("ТаблицаЗначений") И
			ДанныеЗаполнения.НастройкиЗаполненияРеквизитовПередЗаписью.Количество() > 0 Тогда
			НастройкиЗаполненияРеквизитовПередЗаписью.Загрузить(ДанныеЗаполнения.НастройкиЗаполненияРеквизитовПередЗаписью);
		Иначе
			НастройкиЗаполненияРеквизитовПередЗаписью.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("НастройкиСозданияДокументовНаОснованииПослеЗаписи") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.НастройкиСозданияДокументовНаОснованииПослеЗаписи) = Тип("ТаблицаЗначений") И
			ДанныеЗаполнения.НастройкиСозданияДокументовНаОснованииПослеЗаписи.Количество() > 0 Тогда
			НастройкиСозданияДокументовНаОснованииПослеЗаписи.Загрузить(ДанныеЗаполнения.НастройкиСозданияДокументовНаОснованииПослеЗаписи);
		Иначе
			НастройкиСозданияДокументовНаОснованииПослеЗаписи.Очистить();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("НастройкиТабличныхЧастей") И 
		ДанныеЗаполнения.Свойство("СопоставлениеРеквизитовТабличныхЧастей") Тогда
		
		Если ТипЗнч(ДанныеЗаполнения.НастройкиТабличныхЧастей) = Тип("ТаблицаЗначений") И
			ДанныеЗаполнения.НастройкиТабличныхЧастей.Количество() > 0 Тогда
			НастройкиТабличныхЧастей.Загрузить(ДанныеЗаполнения.НастройкиТабличныхЧастей);
		Иначе
			НастройкиТабличныхЧастей.Очистить();
		КонецЕсли;
		
		Если ТипЗнч(ДанныеЗаполнения.СопоставлениеРеквизитовТабличныхЧастей) = Тип("ТаблицаЗначений") И
			ДанныеЗаполнения.СопоставлениеРеквизитовТабличныхЧастей.Количество() > 0 Тогда
			СопоставлениеРеквизитовТабличныхЧастей.Загрузить(ДанныеЗаполнения.СопоставлениеРеквизитовТабличныхЧастей);
		Иначе
			СопоставлениеРеквизитовТабличныхЧастей.Очистить();
		КонецЕсли;
	
	ИначеЕсли ДанныеЗаполнения.Свойство("СоответствияРеквизитовТабличныхЧастей") И 
		ТипЗнч(ДанныеЗаполнения.СоответствияРеквизитовТабличныхЧастей) = Тип("ТаблицаЗначений") И
		ДанныеЗаполнения.СоответствияРеквизитовТабличныхЧастей.Количество() > 0  Тогда
		
		НастройкиТабличныхЧастей.Очистить();
		СопоставлениеРеквизитовТабличныхЧастей.Очистить();
		
		_НастройкиТабличныхЧастей = ДанныеЗаполнения.СоответствияРеквизитовТабличныхЧастей.Скопировать();
		_НастройкиТабличныхЧастей.Свернуть("ТипТаблицы,ИмяТабличнойЧасти");
		_НастройкиТабличныхЧастей.Колонки.Добавить("КлючСвязи", ОбщегоНазначения.ОписаниеТипаСтрока(36));
		
		_СопоставлениеРеквизитовТабличныхЧастей = ДанныеЗаполнения.СоответствияРеквизитовТабличныхЧастей.Скопировать();
		_СопоставлениеРеквизитовТабличныхЧастей.Колонки.Добавить("КлючСвязи", ОбщегоНазначения.ОписаниеТипаСтрока(36));

		Для Каждого _НастройкиТабличныхЧастейСтрока Из _НастройкиТабличныхЧастей Цикл
			
			_НастройкиТабличныхЧастейСтрока.КлючСвязи = Строка(Новый УникальныйИдентификатор());
			
			НайденныеСтрокиСопоставлениеРеквизитовТЧ = _СопоставлениеРеквизитовТабличныхЧастей.НайтиСтроки(
				Новый Структура("ТипТаблицы, ИмяТабличнойЧасти", 
					_НастройкиТабличныхЧастейСтрока.ТипТаблицы, _НастройкиТабличныхЧастейСтрока.ИмяТабличнойЧасти));

			Для Каждого НайденнаяСтрока Из НайденныеСтрокиСопоставлениеРеквизитовТЧ Цикл
				НайденнаяСтрока.КлючСвязи = _НастройкиТабличныхЧастейСтрока.КлючСвязи;
			КонецЦикла;

		КонецЦикла;
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("НастройкиТабличныхЧастей", _НастройкиТабличныхЧастей);
		Запрос.УстановитьПараметр("СопоставлениеРеквизитовТабличныхЧастей", _СопоставлениеРеквизитовТабличныхЧастей);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	_НастройкиТЧ.КлючСвязи КАК КлючСвязи,
			|	_НастройкиТЧ.ТипТаблицы,
			|	_НастройкиТЧ.ИмяТабличнойЧасти,
			|	_НастройкиТЧ.УдалятьПустыеСтроки,
			|	_НастройкиТЧ.ПропускатьПриЗаписи
			|ПОМЕСТИТЬ втНастройкиТЧ
			|ИЗ
			|	&НастройкиТабличныхЧастей КАК _НастройкиТЧ
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	КлючСвязи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СопоставлениеРеквизитовТЧ.КлючСвязи КАК КлючСвязи,
			|	СопоставлениеРеквизитовТЧ.Ключ КАК Поле,
			|	СопоставлениеРеквизитовТЧ.Значение КАК ИмяРеквизита
			|ПОМЕСТИТЬ втСопоставлениеРеквизитовТЧ
			|ИЗ
			|	&СопоставлениеРеквизитовТабличныхЧастей КАК СопоставлениеРеквизитовТЧ
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	КлючСвязи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втНастройкиТЧ.КлючСвязи,
			|	втНастройкиТЧ.ТипТаблицы,
			|	втНастройкиТЧ.ИмяТабличнойЧасти,
			|	втНастройкиТЧ.ПропускатьПриЗаписи,
			|	втНастройкиТЧ.УдалятьПустыеСтроки
			|ИЗ
			|	втНастройкиТЧ КАК втНастройкиТЧ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСопоставлениеРеквизитовТЧ КАК втСопоставлениеРеквизитовТЧ
			|		ПО втНастройкиТЧ.КлючСвязи = втСопоставлениеРеквизитовТЧ.КлючСвязи
			|СГРУППИРОВАТЬ ПО
			|	втНастройкиТЧ.КлючСвязи,
			|	втНастройкиТЧ.ТипТаблицы,
			|	втНастройкиТЧ.ИмяТабличнойЧасти,
			|	втНастройкиТЧ.УдалятьПустыеСтроки,
			|	втНастройкиТЧ.ПропускатьПриЗаписи
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втСопоставлениеРеквизитовТЧ.КлючСвязи,
			|	втСопоставлениеРеквизитовТЧ.Поле,
			|	втСопоставлениеРеквизитовТЧ.ИмяРеквизита
			|ИЗ
			|	втНастройкиТЧ КАК втНастройкиТЧ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСопоставлениеРеквизитовТЧ КАК втСопоставлениеРеквизитовТЧ
			|		ПО втНастройкиТЧ.КлючСвязи = втСопоставлениеРеквизитовТЧ.КлючСвязи
			|СГРУППИРОВАТЬ ПО
			|	втСопоставлениеРеквизитовТЧ.КлючСвязи,
			|	втСопоставлениеРеквизитовТЧ.Поле,
			|	втСопоставлениеРеквизитовТЧ.ИмяРеквизита";
			
		РезультатыЗапроса = Запрос.ВыполнитьПакет();
		
		Если Не РезультатыЗапроса[2].Пустой() И Не РезультатыЗапроса[3].Пустой() Тогда
			
			НастройкиТабличныхЧастей.Загрузить(РезультатыЗапроса[2].Выгрузить());
			СопоставлениеРеквизитовТабличныхЧастей.Загрузить(РезультатыЗапроса[3].Выгрузить());
		
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ПометкаУдаления") Тогда
		ПометкаУдаления = ДанныеЗаполнения.ПометкаУдаления;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Используется") Тогда
		Используется = ДанныеЗаполнения.Используется;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Комментарий") Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ИспользуетсяМаркировка") Тогда
		ИспользуетсяМаркировка = ДанныеЗаполнения.ИспользуетсяМаркировка;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ПроводитьДокумент") Тогда
		ПроводитьДокумент = ДанныеЗаполнения.ПроводитьДокумент;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ЗагружатьВДокумент1СПослеПолученияИзТСД") Тогда
		ЗагружатьВДокумент1СПослеПолученияИзТСД = ДанныеЗаполнения.ЗагружатьВДокумент1СПослеПолученияИзТСД;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ГрупповоеСканирование") Тогда
		ГрупповоеСканирование = ДанныеЗаполнения.ГрупповоеСканирование;
	КонецЕсли;

	Если ДанныеЗаполнения.Свойство("СостояниеДокументаПоУмолчанию") Тогда
		СостояниеДокументаПоУмолчанию = ДанныеЗаполнения.СостояниеДокументаПоУмолчанию;
		Если СостояниеДокументаПоУмолчанию.Пустая() Тогда
			СостояниеДокументаПоУмолчанию = ПредопределенноеЗначение("Перечисление.SUI_СостоянияДокументовОбмена.Новый");
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ИмяОбъектаМетаданных") Тогда
		СинонимОбъектаМетаданных = ДанныеЗаполнения.ИмяОбъектаМетаданных;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Метаданные.Документы.Найти(ИмяОбъектаМетаданных) = Неопределено Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ПроверитьЗаполнениеСоответствияРеквизитов(Отказ);
	ПроверитьЗаполнениеСоответствияРеквизитовТабличныхЧастей(Отказ);
	
	// Для документа Сбор ШК настройки ТЧ не проверять
	Если ИмяОбъектаМетаданных = "SUI_СборШтрихкодов" Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, 
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("НастройкиТабличныхЧастей"));
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяОбъектаМетаданных = Метаданные.Документы.SUI_СборШтрихкодов.Имя Тогда
		
		ГрупповоеСканирование = Ложь;
		ИспользуетсяМаркировка = Ложь;
		КонтролироватьДокумент = Ложь;
		
	КонецЕсли;
	
	ЗаполнитьПараметрыИдентификацииСтрокТЧ();
	
	АлгоритмСозданияНовогоДокумента = СокрЛП(АлгоритмСозданияНовогоДокумента);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если Отказ Или ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "SUI_ЗаполнитьМобильныеУстройстваПриЗаписи", Ложь, Тип("Булево")) Тогда
		ЗаполнитьМобильныеУстройстваПриЗаписи();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьЗаполнениеСоответствияРеквизитов(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыСоответствия = SUI_НастройкиДокументовСервер.ПолучитьРеквизитыСоответствия();
	
	Для Каждого СтрокаСоответствияРеквизитов Из СоответствияРеквизитов Цикл
		
		Если РеквизитыСоответствия.Получить(СтрокаСоответствияРеквизитов.Ключ) = Неопределено Тогда
			СоответствияРеквизитов.Удалить(СтрокаСоответствияРеквизитов);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаСоответствияРеквизитов.Значение) Тогда
			СоответствияРеквизитов.Удалить(СтрокаСоответствияРеквизитов);
			Продолжить;
		КонецЕсли;
		
		Если Метаданные.Документы[ИмяОбъектаМетаданных].Реквизиты.Найти(СтрокаСоответствияРеквизитов.Значение) = Неопределено Тогда
			СоответствияРеквизитов.Удалить(СтрокаСоответствияРеквизитов);
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеСоответствияРеквизитовТабличныхЧастей(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТипыТаблиц = СоответствияРеквизитовТабличныхЧастей.Выгрузить();
	ТипыТаблиц.Свернуть("ИмяТабличнойЧасти, ТипТаблицы");
	
	Для Каждого СтрокаТипыТаблиц Из ТипыТаблиц Цикл

		СтруктураОтбора = Новый Структура("ИмяТабличнойЧасти, ТипТаблицы");
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТипыТаблиц);

		МетаданныеТабличнойЧасти = Метаданные.Документы[ИмяОбъектаМетаданных].ТабличныеЧасти.Найти(СтруктураОтбора.ИмяТабличнойЧасти);
		
		Если МетаданныеТабличнойЧасти = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Для настройки документа %1 табличная часть %2 не существует.'"), 
					ИмяОбъектаМетаданных, СтруктураОтбора.ИмяТабличнойЧасти), 
				ЭтотОбъект, "СоответствияРеквизитовТабличныхЧастей", , Отказ);
			Продолжить;
		КонецЕсли;
		
		РеквизитыСоответсвтия = SUI_НастройкиДокументовСервер.ПолучитьРеквизитыСоответствияТабличныхЧастей(СтруктураОтбора.ТипТаблицы);

		СтрокиСоответствияТЧ = СоответствияРеквизитовТабличныхЧастей.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого СтрокаСоответствияТЧ Из СтрокиСоответствияТЧ Цикл
			
			ОбязательноеЗаполнениеРеквизита = РеквизитыСоответсвтия.Получить(СтрокаСоответствияТЧ.Ключ);
			
			Если ОбязательноеЗаполнениеРеквизита = Неопределено Тогда
				СоответствияРеквизитовТабличныхЧастей.Удалить(СтрокаСоответствияТЧ);
				Продолжить;
			КонецЕсли;
			
			Если ОбязательноеЗаполнениеРеквизита И Не ЗначениеЗаполнено(СтрокаСоответствияТЧ.Значение) Тогда
				СоответствияРеквизитовТабличныхЧастей.Удалить(СтрокаСоответствияТЧ);
				Продолжить;
			КонецЕсли;
			
			Если МетаданныеТабличнойЧасти = Неопределено Тогда
				СоответствияРеквизитовТабличныхЧастей.Удалить(СтрокаСоответствияТЧ);
			Иначе
				
				Если ЗначениеЗаполнено(СтрокаСоответствияТЧ.Значение) И
					МетаданныеТабличнойЧасти.Реквизиты.Найти(СтрокаСоответствияТЧ.Значение) = Неопределено Тогда
					СоответствияРеквизитовТабличныхЧастей.Удалить(СтрокаСоответствияТЧ);
				Иначе
					РеквизитыСоответсвтия.Удалить(СтрокаСоответствияТЧ.Ключ);
				КонецЕсли;

			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого РеквизитСоответствия Из РеквизитыСоответсвтия Цикл
			
			Если Не РеквизитСоответствия.Значение Тогда
				Продолжить;
			КонецЕсли;
			
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Для настройки документа %1 в таблице %2 не заполнено обязательное поле %3.'"), 
				ИмяОбъектаМетаданных, СтруктураОтбора.ТипТаблицы, РеквизитСоответствия.Ключ);
			
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, 
				"СоответствияРеквизитовТабличныхЧастей", , Отказ);

		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИдентификацииСтрокТЧ() 
	
	_ДополнительныеНастройки = ДополнительныеНастройки.Получить();
	
	ПараметрыИдентификацииСтрокТЧ = SUI_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		_ДополнительныеНастройки, "ПараметрыИдентификацииСтрокТЧ", Новый Соответствие(), Тип("Соответствие"));
		
	ТипыТаблицыСПараметрамиИдентификацииСтрок = Новый Массив();
	Для Каждого Элемент Из ПараметрыИдентификацииСтрокТЧ Цикл
		ТипыТаблицыСПараметрамиИдентификацииСтрок.Добавить(Элемент.Ключ);
	КонецЦикла;
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("НастройкиТЧ", НастройкиТабличныхЧастей.Выгрузить(, "ТипТаблицы, КлючСвязи"));
	Запрос.УстановитьПараметр("ТипыТаблицыСПараметрамиИдентификацииСтрок", ТипыТаблицыСПараметрамиИдентификацииСтрок);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НастройкиТЧ.ТипТаблицы КАК ТипТаблицы,
		|	НастройкиТЧ.КлючСвязи КАК КлючСвязи
		|ПОМЕСТИТЬ втНастройкиТЧ
		|ИЗ
		|	&НастройкиТЧ КАК НастройкиТЧ
		|ГДЕ
		|	НЕ НастройкиТЧ.ТипТаблицы В (&ТипыТаблицыСПараметрамиИдентификацииСтрок)";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	Если РезультатыЗапроса[0].Пустой() Тогда
		МенеджерВТ.Закрыть();
		Возврат;
	КонецЕсли;
	
	ВыбираемыеИменаПолейДляТаблицыТовары = Новый Массив();
	ВыбираемыеИменаПолейДляТаблицыТовары.Добавить("Номенклатура");
	ВыбираемыеИменаПолейДляТаблицыТовары.Добавить("Характеристика");
	ВыбираемыеИменаПолейДляТаблицыТовары.Добавить("Упаковка");
	
	ВыбираемыеИменаПолейДляТаблицыШтрихкодыУпаковок = Новый Массив();
	ВыбираемыеИменаПолейДляТаблицыШтрихкодыУпаковок.Добавить("ШтрихкодУпаковки");
	
	ВыбираемыеИменаПолейДляТаблицыСерии = Новый Массив();
	ВыбираемыеИменаПолейДляТаблицыСерии.Добавить("Номенклатура");
	ВыбираемыеИменаПолейДляТаблицыСерии.Добавить("Характеристика");
	ВыбираемыеИменаПолейДляТаблицыСерии.Добавить("Серия");
	ВыбираемыеИменаПолейДляТаблицыСерии.Добавить("Склад");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("СопоставлениеРеквизитовТЧ", СопоставлениеРеквизитовТабличныхЧастей.Выгрузить(, "КлючСвязи, Поле, ИмяРеквизита, ИспользуетсяПостоянноеЗначение"));
	Запрос.УстановитьПараметр("ВыбираемыеИменаПолейДляТаблицыТовары", ВыбираемыеИменаПолейДляТаблицыТовары);
	Запрос.УстановитьПараметр("ВыбираемыеИменаПолейДляТаблицыШтрихкодыУпаковок", ВыбираемыеИменаПолейДляТаблицыШтрихкодыУпаковок);
	Запрос.УстановитьПараметр("ВыбираемыеИменаПолейДляТаблицыСерии", ВыбираемыеИменаПолейДляТаблицыСерии);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СопоставлениеРеквизитовТЧ.КлючСвязи КАК КлючСвязи,
		|	СопоставлениеРеквизитовТЧ.Поле КАК Поле,
		|	СопоставлениеРеквизитовТЧ.ИмяРеквизита КАК ИмяРеквизита,
		|	СопоставлениеРеквизитовТЧ.ИспользуетсяПостоянноеЗначение КАК ИспользуетсяПостоянноеЗначение
		|ПОМЕСТИТЬ втСопоставлениеРеквизитовТЧ
		|ИЗ
		|	&СопоставлениеРеквизитовТЧ КАК СопоставлениеРеквизитовТЧ
		|ГДЕ
		|	НЕ СопоставлениеРеквизитовТЧ.ИспользуетсяПостоянноеЗначение
		|	И СопоставлениеРеквизитовТЧ.ИмяРеквизита <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втНастройкиТЧ.ТипТаблицы КАК ТипТаблицы,
		|	втСопоставлениеРеквизитовТЧ.ИмяРеквизита КАК ИмяРеквизита
		|ИЗ
		|	втНастройкиТЧ КАК втНастройкиТЧ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСопоставлениеРеквизитовТЧ КАК втСопоставлениеРеквизитовТЧ
		|		ПО втНастройкиТЧ.КлючСвязи = втСопоставлениеРеквизитовТЧ.КлючСвязи
		|		И ВЫБОР
		|			КОГДА втНастройкиТЧ.ТипТаблицы В (ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Товары),
		|				ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Отбор),
		|				ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Размещение))
		|				ТОГДА втСопоставлениеРеквизитовТЧ.Поле В (&ВыбираемыеИменаПолейДляТаблицыТовары)
		|			КОГДА втНастройкиТЧ.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок)
		|				ТОГДА втСопоставлениеРеквизитовТЧ.Поле В (&ВыбираемыеИменаПолейДляТаблицыШтрихкодыУпаковок)
		|			КОГДА втНастройкиТЧ.ТипТаблицы = ЗНАЧЕНИЕ(Перечисление.SUI_ТипыТаблицДокументовОбмена.Серии)
		|				ТОГДА втСопоставлениеРеквизитовТЧ.Поле В (&ВыбираемыеИменаПолейДляТаблицыСерии)
		|			ИНАЧЕ ЛОЖЬ
		|		КОНЕЦ
		|ИТОГИ
		|ПО
		|	ТипТаблицы";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МенеджерВТ.Закрыть();
	
	Если Не РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			
			ПараметрыИдентификацииСтрокиТЧ = Новый Структура();
			ПараметрыИдентификацииСтрокиТЧ.Вставить("ТипИдентификацииСтроки", Перечисления.SUI_ТипыИдентификацииСтрокТЧ.ПоСовокупностиРеквизитов);
			ПараметрыИдентификацииСтрокиТЧ.Вставить("РеквизитИдентификацииСтроки", "");
			ПараметрыИдентификацииСтрокиТЧ.Вставить("РеквизитыИдентификацииСтроки", Новый Массив());
			
			ВыборкаРеквизитов = Выборка.Выбрать();
			Пока ВыборкаРеквизитов.Следующий() Цикл
				ПараметрыИдентификацииСтрокиТЧ.РеквизитыИдентификацииСтроки.Добавить(ВыборкаРеквизитов.ИмяРеквизита);
			КонецЦикла;

			ПараметрыИдентификацииСтрокТЧ.Вставить(Выборка.ТипТаблицы, ПараметрыИдентификацииСтрокиТЧ);
			
		КонецЦикла;
		
		_ДополнительныеНастройки.Вставить("ПараметрыИдентификацииСтрокТЧ", ПараметрыИдентификацииСтрокТЧ);
		
		ДополнительныеНастройки = Новый ХранилищеЗначения(_ДополнительныеНастройки, Новый СжатиеДанных(9));
	
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаполнитьМобильныеУстройстваПриЗаписи()
	
	НаборЗаписей = РегистрыСведений.SUI_НастройкиДокументовМобильныхУстройств.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НастройкаДокумента.Установить(Ссылка);
	НаборЗаписей.Заполнить(Новый Структура());
	
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
